# SetDefStoryLayerName

## Description
Sets the name of the nth Default Story Layer in the file. For example, if 3 is passed in, it will set the name of the 3rd Default Story Layer in the file.

```pascal
FUNCTION SetDefStoryLayerName(
				index : INTEGER;
				name  : STRING) : BOOLEAN;
```

```python

def vs.SetDefStoryLayerName(index, name):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|INTEGER|The index of the default story layer whose name should be set.|
|name|STRING|The name that the indicated default story layer should be set to.|

## Returns
Whether the setting of the name of the default story layer succeeded. It will fail if passed an invalid index. The name must not have more than 63 characters and must not be used by another default story layer in the file.

## Examples
```pascal
VAR

result : BOOLEAN;

BEGIN

result := SetStoryLayerTemplateName(2, &quot;Subfloor&quot;);
```

## See Also
VS Functions:
GetNumStoryLayerTemplates| GetStoryLayerTemplateName

## Version
Availability: from Vectorworks 2013
## Category
* Layers